tobliao/Microchip-Projects-MASTER-2025/CAN/src/packs/PIC32CM3204GV00048_DFP/pio/pic32cm3204gv00048.h
/* =================== PORT definition for TC0 peripheral =================== */
#define PIN_PA04F_TC0_WO0                          _UINT32_(4) 
#define MUX_PA04F_TC0_WO0                          _UINT32_(5) 
#define PINMUX_PA04F_TC0_WO0                       ((PIN_PA04F_TC0_WO0 << 16) | MUX_PA04F_TC0_WO0)
#define PORT_PA04F_TC0_WO0                         (_UINT32_(1) << 4)

#define PIN_PA08E_TC0_WO0                          _UINT32_(8) 
#define MUX_PA08E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PA08E_TC0_WO0                       ((PIN_PA08E_TC0_WO0 << 16) | MUX_PA08E_TC0_WO0)
#define PORT_PA08E_TC0_WO0                         (_UINT32_(1) << 8)

#define PIN_PA05F_TC0_WO1                          _UINT32_(5) 
#define MUX_PA05F_TC0_WO1                          _UINT32_(5) 
#define PINMUX_PA05F_TC0_WO1                       ((PIN_PA05F_TC0_WO1 << 16) | MUX_PA05F_TC0_WO1)
#define PORT_PA05F_TC0_WO1                         (_UINT32_(1) << 5)

#define PIN_PA09E_TC0_WO1                          _UINT32_(9) 
#define MUX_PA09E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PA09E_TC0_WO1                       ((PIN_PA09E_TC0_WO1 << 16) | MUX_PA09E_TC0_WO1)
#define PORT_PA09E_TC0_WO1                         (_UINT32_(1) << 9)

/* =================== PORT definition for TC1 peripheral =================== */
#define PIN_PA06F_TC1_WO0                          _UINT32_(6) 
#define MUX_PA06F_TC1_WO0                          _UINT32_(5) 
#define PINMUX_PA06F_TC1_WO0                       ((PIN_PA06F_TC1_WO0 << 16) | MUX_PA06F_TC1_WO0)
#define PORT_PA06F_TC1_WO0                         (_UINT32_(1) << 6)

#define PIN_PA30F_TC1_WO0                          _UINT32_(30)
#define MUX_PA30F_TC1_WO0                          _UINT32_(5) 
#define PINMUX_PA30F_TC1_WO0                       ((PIN_PA30F_TC1_WO0 << 16) | MUX_PA30F_TC1_WO0)
#define PORT_PA30F_TC1_WO0                         (_UINT32_(1) << 30)

#define PIN_PA10E_TC1_WO0                          _UINT32_(10)
#define MUX_PA10E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA10E_TC1_WO0                       ((PIN_PA10E_TC1_WO0 << 16) | MUX_PA10E_TC1_WO0)
#define PORT_PA10E_TC1_WO0                         (_UINT32_(1) << 10)

#define PIN_PA07F_TC1_WO1                          _UINT32_(7) 
#define MUX_PA07F_TC1_WO1                          _UINT32_(5) 
#define PINMUX_PA07F_TC1_WO1                       ((PIN_PA07F_TC1_WO1 << 16) | MUX_PA07F_TC1_WO1)
#define PORT_PA07F_TC1_WO1                         (_UINT32_(1) << 7)

#define PIN_PA31F_TC1_WO1                          _UINT32_(31)
#define MUX_PA31F_TC1_WO1                          _UINT32_(5) 
#define PINMUX_PA31F_TC1_WO1                       ((PIN_PA31F_TC1_WO1 << 16) | MUX_PA31F_TC1_WO1)
#define PORT_PA31F_TC1_WO1                         (_UINT32_(1) << 31)

#define PIN_PA11E_TC1_WO1                          _UINT32_(11)
#define MUX_PA11E_TC1_WO1                          _UINT32_(4) 
#define PINMUX_PA11E_TC1_WO1                       ((PIN_PA11E_TC1_WO1 << 16) | MUX_PA11E_TC1_WO1)
#define PORT_PA11E_TC1_WO1                         (_UINT32_(1) << 11)

/* =================== PORT definition for TC2 peripheral =================== */
#define PIN_PA16F_TC2_WO0                          _UINT32_(16)
#define MUX_PA16F_TC2_WO0                          _UINT32_(5) 
#define PINMUX_PA16F_TC2_WO0                       ((PIN_PA16F_TC2_WO0 << 16) | MUX_PA16F_TC2_WO0)
#define PORT_PA16F_TC2_WO0                         (_UINT32_(1) << 16)

#define PIN_PA12E_TC2_WO0                          _UINT32_(12)
#define MUX_PA12E_TC2_WO0                          _UINT32_(4) 
#define PINMUX_PA12E_TC2_WO0                       ((PIN_PA12E_TC2_WO0 << 16) | MUX_PA12E_TC2_WO0)
#define PORT_PA12E_TC2_WO0                         (_UINT32_(1) << 12)

#define PIN_PA00F_TC2_WO0                          _UINT32_(0) 
#define MUX_PA00F_TC2_WO0                          _UINT32_(5) 
#define PINMUX_PA00F_TC2_WO0                       ((PIN_PA00F_TC2_WO0 << 16) | MUX_PA00F_TC2_WO0)
#define PORT_PA00F_TC2_WO0                         (_UINT32_(1) << 0)

#define PIN_PA17F_TC2_WO1                          _UINT32_(17)
#define MUX_PA17F_TC2_WO1                          _UINT32_(5) 
#define PINMUX_PA17F_TC2_WO1                       ((PIN_PA17F_TC2_WO1 << 16) | MUX_PA17F_TC2_WO1)
#define PORT_PA17F_TC2_WO1                         (_UINT32_(1) << 17)

#define PIN_PA13E_TC2_WO1                          _UINT32_(13)
#define MUX_PA13E_TC2_WO1                          _UINT32_(4) 
#define PINMUX_PA13E_TC2_WO1                       ((PIN_PA13E_TC2_WO1 << 16) | MUX_PA13E_TC2_WO1)
#define PORT_PA13E_TC2_WO1                         (_UINT32_(1) << 13)

#define PIN_PA01F_TC2_WO1                          _UINT32_(1) 
#define MUX_PA01F_TC2_WO1                          _UINT32_(5) 
#define PINMUX_PA01F_TC2_WO1                       ((PIN_PA01F_TC2_WO1 << 16) | MUX_PA01F_TC2_WO1)
#define PORT_PA01F_TC2_WO1                         (_UINT32_(1) << 1)

/* =================== PORT definition for TC3 peripheral =================== */
#define PIN_PA18F_TC3_WO0                          _UINT32_(18)
#define MUX_PA18F_TC3_WO0                          _UINT32_(5) 
#define PINMUX_PA18F_TC3_WO0                       ((PIN_PA18F_TC3_WO0 << 16) | MUX_PA18F_TC3_WO0)
#define PORT_PA18F_TC3_WO0                         (_UINT32_(1) << 18)

#define PIN_PA14E_TC3_WO0                          _UINT32_(14)
#define MUX_PA14E_TC3_WO0                          _UINT32_(4) 
#define PINMUX_PA14E_TC3_WO0                       ((PIN_PA14E_TC3_WO0 << 16) | MUX_PA14E_TC3_WO0)
#define PORT_PA14E_TC3_WO0                         (_UINT32_(1) << 14)

#define PIN_PA19F_TC3_WO1                          _UINT32_(19)
#define MUX_PA19F_TC3_WO1                          _UINT32_(5) 
#define PINMUX_PA19F_TC3_WO1                       ((PIN_PA19F_TC3_WO1 << 16) | MUX_PA19F_TC3_WO1)
#define PORT_PA19F_TC3_WO1                         (_UINT32_(1) << 19)

#define PIN_PA15E_TC3_WO1                          _UINT32_(15)
#define MUX_PA15E_TC3_WO1                          _UINT32_(4) 
#define PINMUX_PA15E_TC3_WO1                       ((PIN_PA15E_TC3_WO1 << 16) | MUX_PA15E_TC3_WO1)
#define PORT_PA15E_TC3_WO1                         (_UINT32_(1) << 15)

/* =================== PORT definition for TC4 peripheral =================== */
#define PIN_PA22F_TC4_WO0                          _UINT32_(22)
#define MUX_PA22F_TC4_WO0                          _UINT32_(5) 
#define PINMUX_PA22F_TC4_WO0                       ((PIN_PA22F_TC4_WO0 << 16) | MUX_PA22F_TC4_WO0)
#define PORT_PA22F_TC4_WO0                         (_UINT32_(1) << 22)

#define PIN_PB08F_TC4_WO0                          _UINT32_(40)
#define MUX_PB08F_TC4_WO0                          _UINT32_(5) 
#define PINMUX_PB08F_TC4_WO0                       ((PIN_PB08F_TC4_WO0 << 16) | MUX_PB08F_TC4_WO0)
#define PORT_PB08F_TC4_WO0                         (_UINT32_(1) << 8)

#define PIN_PA23F_TC4_WO1                          _UINT32_(23)
#define MUX_PA23F_TC4_WO1                          _UINT32_(5) 
#define PINMUX_PA23F_TC4_WO1                       ((PIN_PA23F_TC4_WO1 << 16) | MUX_PA23F_TC4_WO1)
#define PORT_PA23F_TC4_WO1                         (_UINT32_(1) << 23)

#define PIN_PB09F_TC4_WO1                          _UINT32_(41)
#define MUX_PB09F_TC4_WO1                          _UINT32_(5) 
#define PINMUX_PB09F_TC4_WO1                       ((PIN_PB09F_TC4_WO1 << 16) | MUX_PB09F_TC4_WO1)
#define PORT_PB09F_TC4_WO1                         (_UINT32_(1) << 9)

/* =================== PORT definition for TC5 peripheral =================== */
#define PIN_PA24F_TC5_WO0                          _UINT32_(24)
#define MUX_PA24F_TC5_WO0                          _UINT32_(5) 
#define PINMUX_PA24F_TC5_WO0                       ((PIN_PA24F_TC5_WO0 << 16) | MUX_PA24F_TC5_WO0)
#define PORT_PA24F_TC5_WO0                         (_UINT32_(1) << 24)

#define PIN_PB10F_TC5_WO0                          _UINT32_(42)
#define MUX_PB10F_TC5_WO0                          _UINT32_(5) 
#define PINMUX_PB10F_TC5_WO0                       ((PIN_PB10F_TC5_WO0 << 16) | MUX_PB10F_TC5_WO0)
#define PORT_PB10F_TC5_WO0                         (_UINT32_(1) << 10)

#define PIN_PA25F_TC5_WO1                          _UINT32_(25)
#define MUX_PA25F_TC5_WO1                          _UINT32_(5) 
#define PINMUX_PA25F_TC5_WO1                       ((PIN_PA25F_TC5_WO1 << 16) | MUX_PA25F_TC5_WO1)
#define PORT_PA25F_TC5_WO1                         (_UINT32_(1) << 25)

#define PIN_PB11F_TC5_WO1                          _UINT32_(43)
#define MUX_PB11F_TC5_WO1                          _UINT32_(5) 
#define PINMUX_PB11F_TC5_WO1                       ((PIN_PB11F_TC5_WO1 << 16) | MUX_PB11F_TC5_WO1)
#define PORT_PB11F_TC5_WO1                         (_UINT32_(1) << 11)



#endif /* _PIC32CM3204GV00048_GPIO_H_ */

